# La clase DataFrame

Un `DataFrame` es una agrupación de `Series` unidas bajo los mismos índices dando como resultado estructuras similares a tablas donde representar todo tipo de información.

Cada serie del `DataFrame` se puede considerar una columna a la cuál podemos establecer un nombre:

In [1]:
import pandas as pd
import numpy as np

array = np.random.randint(-10, 10, size=[4,4])

df = pd.DataFrame(array, index=['A','B','C','D'], columns=['W','X','Y','Z'])

In [2]:
# Representación en jupyter
df

   W  X  Y  Z
A -7  9  9  2
B -1 -1 -3 -4
C  1  3 -1  9
D  2  0  3  6

In [3]:
# Representación por pantalla
print(df)

   W  X  Y  Z
A -7  9  9  2
B -1 -1 -3 -4
C  1  3 -1  9
D  2  0  3  6

In [4]:
# Tipo de un df
type(df)

pandas.core.frame.DataFrame

## Trabajando con DataFrames

Podemos consultar una columna mediante su nombre:

In [5]:
df['X']

A    9
B   -1
C    3
D    0
Name: X, dtype: int32

Como vemos una columna es en realidad una serie:

In [8]:
type(df['X'])

pandas.core.series.Series

También podemos consultar varias columnas pasando una lista con los nombres:

In [7]:
df[['Y','Z']]

   Y  Z
A  9  2
B -3 -4
C -1  9
D  3  6

### Añadir una columna

In [9]:
df['TOTAL'] = df['W'] + df['X'] + df['Y'] + df['Z']

In [10]:
df

   W  X  Y  Z  TOTAL
A -7  9  9  2     13
B -1 -1 -3 -4     -9
C  1  3 -1  9     12
D  2  0  3  6     11

### Borrar una columna

In [11]:
df.drop('TOTAL', axis=1) #Eje 1 axis =0 filas

   W  X  Y  Z
A -7  9  9  2
B -1 -1 -3 -4
C  1  3 -1  9
D  2  0  3  6

In [12]:
# No se modifica el df original
df

   W  X  Y  Z  TOTAL
A -7  9  9  2     13
B -1 -1 -3 -4     -9
C  1  3 -1  9     12
D  2  0  3  6     11

In [13]:
# A no ser que le indiquemos explícitamente
df.drop('TOTAL', axis=1, inplace=True)

df

   W  X  Y  Z
A -7  9  9  2
B -1 -1 -3 -4
C  1  3 -1  9
D  2  0  3  6

### Borrar una fila

In [14]:
df.drop('D', axis=0)

   W  X  Y  Z
A -7  9  9  2
B -1 -1 -3 -4
C  1  3 -1  9

### Seleccionar filas

In [15]:
df.loc['C']

W    1
X    3
Y   -1
Z    9
Name: C, dtype: int32

También podemos utilizar el índice:

In [16]:
df.iloc[2]

W    1
X    3
Y   -1
Z    9
Name: C, dtype: int32

### Seleccionar subset

In [17]:
# Fila C y columna Z 
df.loc['C','Z']

9

In [18]:
# Filas A,B y columnas W,Y
df.loc[['A','B'],['W','Y']]

   W  Y
A -7  9
B -1 -3

## Selección condicionada

Una de las mayores utilidades de los `DataFrames` es su capacidad para realizar consultas condicionadas:

In [19]:
df

   W  X  Y  Z
A -7  9  9  2
B -1 -1 -3 -4
C  1  3 -1  9
D  2  0  3  6

In [20]:
# Registros >0
df>0

       W      X      Y      Z
A  False   True   True   True
B  False  False  False  False
C   True   True  False   True
D   True  False   True   True

In [21]:
# Valor de los registros >0
df[df>0]

     W    X    Y    Z
A  NaN  9.0  9.0  2.0
B  NaN  NaN  NaN  NaN
C  1.0  3.0  NaN  9.0
D  2.0  NaN  3.0  6.0

In [22]:
# Valor de los registros cuando X>0
df[df['X']>0]

   W  X  Y  Z
A -7  9  9  2
C  1  3 -1  9

In [23]:
# Valor de los registros en las columnas Y,Z si X>0
df[df['X']>0][['Y','Z']]

   Y  Z
A  9  2
C -1  9

Podemos unir condiciones usando los operadores `or` con `|` y `and` con `&`:

In [24]:
# Valor de los registros cuando X>0 o Z<0
df[(df['X']>0) | (df['Z'] < 0)]

   W  X  Y  Z
A -7  9  9  2
B -1 -1 -3 -4
C  1  3 -1  9

In [25]:
# Valor de los registros en las columnas W e Y cuando X>0 o Z<0
df[(df['X']>0) | (df['Z'] < 0)][['W','Y']]

   W  Y
A -7  9
B -1 -3
C  1 -1

## Modificar índices

In [ ]:
# Creamos de nuevo el dataframe
array = np.random.uniform(-10, 10, size=[4,4])
df = pd.DataFrame(array, index=['A','B','C','D'], columns=['W','X','Y','Z'])
df

In [ ]:
# Añadimos una nueva Serie con el nombre de los índices
df['Códigos'] = ['AA','BB','CC','DD']

df

In [ ]:
# Substituimos los índices de las filas
df.set_index('Códigos')

In [ ]:
# No se guardan por defecto
df

In [ ]:
# A no ser que lo especifiquemos explícitamente
df.set_index('Códigos', inplace=True)

df

In [ ]:
print(df)

In [ ]:
# consultamos una fila con el nuevo índice
df.loc['AA']

### Índices por defecto

In [ ]:
# Reiniciamos los índices y borramos los anteriores explícitamente
df.reset_index(drop=True, inplace=True)

df

Esto es solo la punta del iceberg, para más información sobre la clase `DataFrame` tenéis la [documentación oficial](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html).